# vim:ft=ruby

if OS.mac?
    brew "noti" # utility to display notifications from scripts
    brew "trash" # rm, but put in the trash rather than completely delete

elsif OS.linux?
    brew "xclip" # access to clipboard (similar to pbcopy/pbpaste)
end

tap "homebrew/bundle"
tap "nodenv/nodenv"

# packages
brew "ast-grep"
brew "bat" # better cat
brew "cloc" # lines of code counter
brew "entr" # file watcher / command runner
brew "eza" # ls alternative
brew "fastlane" # tool for iOS/Android development
brew "fd" # find alternative
brew "fzf" # Fuzzy file searcher, used in scripts and in vim
brew "gh" # GitHub CLI
brew "git-delta" # a better git diff
brew "git-lfs"
brew "git-secrets" # prevents secret values geting into Git repo
brew "glow" # markdown viewer
brew "gnupg" # GPG
brew "grep" # grep (latest)
brew "highlight" # code syntax highlighting
brew "htop" # a top alternative
brew "jandedobbeleer/oh-my-posh/oh-my-posh" # a prompt theme engine
brew "jq" # work with JSON files in shell scripts
brew "lazydocker" # a better docker UI
brew "lazygit" # a better git UI
brew "libpq" # libraries for PostgreSQL
brew "mise" # https://mise.jdx.dev/
brew "neovim" # A better vim
brew "python" # python (latest)
brew "postgresql"
brew "pgcli"
brew "rbenv" # Ruby version manager
brew "ripgrep" # very fast file searcher
brew "shellcheck" # diagnostics for shell sripts
brew "tree" # pretty-print directory contents
brew "unar" # the unarchiver
brew "wdiff" # word differences in text files
brew "wget" # internet file retriever
brew "zoxide" # switch between most used directories
brew "zsh" # zsh (latest)
brew "1password-cli"

cask "font-fira-code-nerd-font"
cask "ghostty"
cask "karabiner-elements"
cask "google-cloud-sdk"

